In [1]:
import pandas as pd

In [2]:
file = "Resources/sampleData.csv"

In [4]:
original_df = pd.read_csv(file)
original_df

     id first_name   last_name       Phone Number      Time zone
0     1      Peter  Richardson    7-(789)867-9023  Europe/Moscow
1     2     Janice       Berry   86-(614)973-1727    Asia/Harbin
2     3     Andrea      Hudson   86-(918)527-6371  Asia/Shanghai
3     4     Arthur    Mcdonald  420-(553)779-7783  Europe/Prague
4     5      Kathy     Morales  351-(720)541-2124  Europe/Lisbon
..  ...        ...         ...                ...            ...
95   96     Arthur   Henderson   81-(353)751-4060     Asia/Tokyo
96   97  Christina       Riley   93-(374)749-5085     Asia/Kabul
97   98   Nicholas       Green   86-(750)462-3375  Asia/Shanghai
98   99      Debra      Peters   86-(879)987-9025  Asia/Shanghai
99  100    Matthew      Murray  353-(195)215-1300  Europe/Dublin

[100 rows x 5 columns]

In [5]:
# Set new index to last_name
df = original_df.set_index("last_name")
df.head()

            id first_name       Phone Number      Time zone
last_name
Richardson   1      Peter    7-(789)867-9023  Europe/Moscow
Berry        2     Janice   86-(614)973-1727    Asia/Harbin
Hudson       3     Andrea   86-(918)527-6371  Asia/Shanghai
Mcdonald     4     Arthur  420-(553)779-7783  Europe/Prague
Morales      5      Kathy  351-(720)541-2124  Europe/Lisbon

In [12]:
# Grab the data contained within the "Berry" row and the "Phone Number" column
x = "Day"
y = "Phone Number"

berry_phone = df.loc[x,[y,"Time zone"]]
print( berry_phone)

also_berry_phone = df.iloc[1, 2]
print("Using Iloc: " + also_berry_phone)

               Phone Number      Time zone
last_name
Day         7-(863)797-2311  Europe/Moscow
Day        63-(142)279-5867    Asia/Manila
Using Iloc: 86-(614)973-1727

In [15]:
# Grab the first five rows of data and the columns from "id" to "Phone Number"
# The problem with using "last_name" as the index is that the values are not unique so duplicates are returned
# If there are duplicates and loc[] is being used, Pandas will return an error
richardson_to_morales = df.loc[["Richardson", "Berry", "Hudson",
                                "Mcdonald", "Morales"], ["id", "first_name", "Phone Number"]]
print(richardson_to_morales)

print()

# Using iloc[] will not find duplicates since a numeric index is always unique
also_richardson_to_morales = df.iloc[0:4, 0:3]
print(also_richardson_to_morales)

            id first_name       Phone Number
last_name
Richardson   1      Peter    7-(789)867-9023
Richardson  25     Donald   62-(259)282-5871
Berry        2     Janice   86-(614)973-1727
Hudson       3     Andrea   86-(918)527-6371
Hudson       8    Frances   57-(752)864-4744
Hudson      90      Norma  351-(551)598-1822
Mcdonald     4     Arthur  420-(553)779-7783
Morales      5      Kathy  351-(720)541-2124

            id first_name       Phone Number
last_name
Richardson   1      Peter    7-(789)867-9023
Berry        2     Janice   86-(614)973-1727
Hudson       3     Andrea   86-(918)527-6371
Mcdonald     4     Arthur  420-(553)779-7783

In [18]:
# The following will select all rows for columns `first_name` and `Phone Number`
df.loc[:, ["first_name", "Phone Number","id"]].tail()

          first_name       Phone Number   id
last_name
Henderson     Arthur   81-(353)751-4060   96
Riley      Christina   93-(374)749-5085   97
Green       Nicholas   86-(750)462-3375   98
Peters         Debra   86-(879)987-9025   99
Murray       Matthew  353-(195)215-1300  100

In [25]:
# the following logic test/conditional statement returns a series of boolean values
named_billy = df["first_name"] == "Billy"
named_billy

last_name
Richardson    False
Berry         False
Hudson        False
Mcdonald      False
Morales       False
              ...
Henderson     False
Riley         False
Green         False
Peters        False
Murray        False
Name: first_name, Length: 100, dtype: bool

In [26]:
# Loc and Iloc also allow for conditional statments to filter rows of data
# using Loc on the logic test above only returns rows where the result is True
only_billys = df.loc[df["first_name"] == "Billy", :]
print(only_billys)
print("hi")
#print()

# Multiple conditions can be set to narrow down or widen the filter
only_billy_and_peter = df.loc[(df["first_name"] == "Billy") | (
    df["first_name"] == "Peter"), :]
print(only_billy_and_peter)

           id first_name      Phone Number       Time zone
last_name
Clark      20      Billy  62-(213)345-2549   Asia/Makassar
Andrews    23      Billy  86-(859)746-5367  Asia/Chongqing
Price      59      Billy  86-(878)547-7739   Asia/Shanghai
hi
            id first_name      Phone Number       Time zone
last_name
Richardson   1      Peter   7-(789)867-9023   Europe/Moscow
Clark       20      Billy  62-(213)345-2549   Asia/Makassar
Andrews     23      Billy  86-(859)746-5367  Asia/Chongqing
Price       59      Billy  86-(878)547-7739   Asia/Shanghai